import spacy
import random
from pathlib import Path

# Пример тренировочных данных
# Формат: (текст, {"entities": [(начальный_символ, конечный_символ, 'МЕТКА')]})
TRAIN_DATA = [
    ("Я живу в на улице Ленина дом 51.", {
        "entities": [
            (9, 21, "CITY_FULL"),         # "городе Москва"
            (25, 37, "STREET_FULL"),     # "улице Ленина"
            (38, 41, "BUILDING_TYPE"),   # "дом"
            (42, 44, "BUILDING_NUMBER")  # "51"
        ]
    }),
    ("Мой офис расположен в городе Санкт-Петербург, Невский проспект 12.", {
        "entities": [
            (22, 42, "CITY_FULL"),         # "городе Санкт-Петербург"
            (44, 59, "STREET_FULL"),     # "Невский проспект"
            (60, 62, "BUILDING_NUMBER")  # "12"
        ]
    }),
    ("В деревне Гадюкино, улица Центральная, строение 3а.", {
        "entities": [
            (3, 19, "CITY_FULL"),         # "деревне Гадюкино"
            (21, 38, "STREET_FULL"),     # "улица Центральная"
            (40, 48, "BUILDING_TYPE"),   # "строение"
            (49, 51, "BUILDING_NUMBER")  # "3а"
        ]
    }),
    ("Нахожусь в Краснодаре, Пушкина 23, корпус 5.", {
        "entities": [
            (11, 20, "CITY_FULL"),         # "Краснодаре"
            (22, 29, "STREET_FULL"),     # "Пушкина"
            (30, 32, "BUILDING_NUMBER"),  # "23"
            (34, 40, "BUILDING_TYPE"),   # "корпус"
            (41, 42, "BUILDING_NUMBER")  # "5"
        ]
    }),
    ("Рядом с метро Выхино, проспект Рязанский 78.", {
        "entities": [
            (14, 20, "CITY_FULL"), # "Выхино" - хотя это метро, но для примера можно считать населенным пунктом или использовать другую метку, если нужна детализация
            (22, 39, "STREET_FULL"), # "проспект Рязанский"
            (40, 42, "BUILDING_NUMBER") # "78"
        ]
    })
]
